{
  "page_title": "Resume of PeterCxy (Xiyu Cai)",
  "ga_id": "",
  "name": "PeterCxy (Xiyu Cai)",
  "tag": "A future full-stack engineer",
  "presentation": "An undergraduate student at Xi'an Jiaotong-Liverpool University majoring in Information & Computing Science. An Android developer, Node.js developer and frontend developer. Believer of Free Software and contributor of many opensource projects. Love hacking and learning new things about computers, especially different programming languages.",
  "mobile_phone": "+1 (573) 575-8717 (Google Voice)",
  "wechat_id":"KawaiYuion",
  "personal_mail": "peter@typeblog.net",
  "work_mail": "xiyu.cai16@student.xjtlu.edu.cn",
  "skills": [
    { "key": "Android", "value": 60 },
    { "key": "node.js", "value": 60 },
    { "key": "Front-End", "value": 40 },
    { "key": "Design", "value": 40 },
    { "key": "CoffeeScript", "value": 65 },
    { "key": "TypeScript", "value": 60 },
    { "key": "JavaScript", "value": 70 },
    { "key": "Java", "value": 50 },
    { "key": "Go", "value": 35 },
    { "key": "Linux", "value": 75 }
  ],
  "github": "PeterCxy",
  "blog": "https://typeblog.net",
  "introduction": [
    "I am currently an undergraducate student at XJTLU majoring in Information & Computing Science. During my primary schoool years, I began getting interested in computers, especially programming and engineering thanks to one of my primary school teachers who introduced me to the Linux world. I attempted to start my own business (selling hosting service) in middle school years, and though failed, a lot of experience in operating and maintaining Linux servers was gained through it.",
    "After entering high school, I switched to Linux as my daily OS. I wrote my first Android application, <a href='https://github.com/PaperAirplane-Dev-Team/BlackLight'>BlackLight</a>, an alternative Sina Weibo client for Androidi which was later transferred to <a href='https://github.com/PaperAirplane-Dev-Team'>PaperAirplane</a> as a team project. During this, my passion for hacking, developing and learning were more than motivated and that was for now my most productive time - I also learnt node.js and frontend for that project, since there was only me as the main contributor.",
    "Currently, I am trying to become a full-stack engineer in the future while mainly focusing on B/S technology (Node.js/Python/Go/Java/Nim + HTML/JS/CSS). I am also capable of mobile developement if necessary. Contact me if interested in offering me a position or just want a chat."
  ],
  "work": [
    {
      "title": "DevOps",
      "company": "PaperAirplane Dev Team",
      "date": "2014 - NOW",
      "text": "A team built by students. I am one of the main contributors and developer of BlackLight as a project of the team.<br><br>"
    }
  ],
  "education": [
    {
      "professional": "Information & Computing Science",
      "school": "Xi'an Jiaotong-Liverpool University",
      "date": "2016 - NOW",
      "text": ""
    }
  ]
}
